frontend/controllers/UsersController.php

INSERT INTO `users` (`name`, `email`, `mobile`, `password`) VALUES ('amira', 'amira@dmd', '23323', '521323')
---
    public function actionCreate()
    {
        $model = new Users();

        // new record
        if($model->load(Yii::$app->request->post()) && $model->save()){

SELECT * FROM `users`
---
  public function actionIndex()
    {
        $student = Users::find()->all();

SELECT * FROM `users` WHERE `id`='2'
UPDATE `users` SET `password`='52132' WHERE `id`=2
---
        public function actionEdit($id)
    {
        $model = Users::find()->where(['id' => $id])->one();

        // $id not found in database
        if($model === null)
            throw new NotFoundHttpException('The requested page does not exist.');

        // update record
        if($model->load(Yii::$app->request->post()) && $model->save()){

SELECT * FROM `users` WHERE `id`='1'
DELETE FROM `users` WHERE `id`=1
---
         public function actionDelete($id)
     {
         $model = Users::findOne($id);

        // $id not found in database
        if($model === null)
            throw new NotFoundHttpException('The requested page does not exist.');

        // delete record
        $model->delete();